# ElementCategoryChangeInvalidatesTag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..ElementCategoryChangeInvalidatesTag Property
BuiltInFailures..::..TagFailures Class See Also
---
Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementCategoryChangeInvalidatesTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTag As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTag {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace